# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 9  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:  # AutoAnchor evolves 3 anchors per P output layer
  - [35,41, 52,47, 40,61]  # P2/4
  - [55,67, 73,55, 57,87]  # P3/8
  - [77,81, 96,71, 67,108]  # P4/16
  - [88,112, 123,100, 114,157] # P5/32
#  - [10,13, 16,30, 33,23]  # P3/8
#  - [30,61, 62,45, 59,119]  # P4/16
#  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]  3*640*640
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2  64*320*320
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4   128*160*160
   [-1, 3, C3, [128]],   # 128*160*160
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8   256*80*80
   [-1, 6, C3, [256]],   # 256*80*80
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16  512*40*40
   [-1, 9, C3, [512]],   # 512*40*40
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32 1024*20*20
   [-1, 3, C3, [1024]],  # 1024*20*20
   [-1, 1, SPPF, [1024, 5]],  # 9  1024*20*20
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]],  #  512*20*20
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 512*40*40
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4 # 1024*40*40
   [-1, 3, C3, [512, False]],  # 13 512*40*40

   [-1, 1, Conv, [256, 1, 1]], # 256*40*40
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 256*80*80
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3 512*80*80
   [-1, 3, C3, [256, False]],  # 17  256*80*80

   [-1, 1, Conv, [128, 1, 1]], # 128*80*80
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 128*160*160
   [[-1, 2], 1, Concat, [1]],  # cat backbone P2 256*160*160
   [-1, 3, C3, [128, False]],  # 21 (P2/4-tiny) 128*160*160

   [-1, 1, Conv, [128, 3, 2]], # 128*80*80
   [[-1, 18], 1, Concat, [1]],  # cat head P3 256*80*80
   [-1, 3, C3, [256, False]],  # 24 (P3/8-small) 256*80*80

   [-1, 1, Conv, [256, 3, 2]], # 256*40*40
   [[-1, 14], 1, Concat, [1]],  # cat head P4  512*40*40
   [-1, 3, C3, [512, False]],  # 27 (P4/16-medium)  512*40*40

   [-1, 1, Conv, [512, 3, 2]],  # 512*20*20
   [[-1, 10], 1, Concat, [1]],  # cat head P5 1024*20*20
   [-1, 3, C3, [1024, False]],  # 20 (P5/32-large)  1024*20*20

   [[21, 24, 27, 30], 1, Detect, [nc, anchors]],  # Detect(P2, P3, P4, P5)
  ]
